# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [4]:
# Importamos librerias
import pandas as pd
import numpy as np
import sqlite3 as sql

In [5]:
# Conectamos con la base de datos chinook.db

path = "chinook.db"
connection = sql.connect(path)
# Obtenemos un cursor que utilizaremos para hacer las queries
curs = connection.cursor() #representa un objeto como si ufera la base de datos

In [6]:
# Creamos una Query sencilla se puede poner todo en una linea
query="""
SELECT *
FROM genres
"""

In [7]:
my_query = curs.execute(query) #con cursor ejecutamos la query

In [8]:
my_query.fetchall() #traemos todo aqui una lista de tuplas faltan los nombres de las columnas

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [9]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas leemos los headers tb
def sql_query(query):
    curs.execute(query) #para ejecutar la consutla
    datos_query = curs.fetchall() #para traer datos 
    col_names = [description [0] for description in curs.description]
    return pd.DataFrame(datos_query,columns=col_names)

In [10]:
sql_query(query)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [11]:
# Tambien podemos obtener el mismo resultado directamente con pandas

pd.read_sql_query(query,connection) #connection es par conectar con el archivo de sql

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [12]:
#necesitamos clientes con la tabla de facturas necesitamos las key id para poder relacionar dos tablas relacionales en este caso se hace por customerId -> tablas relacionales por eso se pueden relacionar join nos va a mostrar la interseccion es decir lo comun de las dos tablas where es un inner join es decir interseccion mejor usar join, porque nos permite usar left join, outter join inner join right join
#con where para cada linea si para cada fila de costumerid coincide con algun valor de invoices en la columna de id
query = """
SELECT *
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId """
pd.read_sql_query(query,connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [13]:
# le podemos poner alias ->customers c invoices -> i #join tiene como base inner por eso el numer ode rows es el mismo solo quiero ver esos campos, partiendo desde costumers uniendo con invoice para el pais brasil
query = """
SELECT c.Firstname ||''||c.Lastname as "Fullname", i.invoiceId,i.invoiceDate,i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country= "Brazil" """
pd.read_sql_query(query,connection)

          Fullname  InvoiceId          InvoiceDate BillingCountry
0    LuísGonçalves         98  2010-03-11 00:00:00         Brazil
1    LuísGonçalves        121  2010-06-13 00:00:00         Brazil
2    LuísGonçalves        143  2010-09-15 00:00:00         Brazil
3    LuísGonçalves        195  2011-05-06 00:00:00         Brazil
4    LuísGonçalves        316  2012-10-27 00:00:00         Brazil
5    LuísGonçalves        327  2012-12-07 00:00:00         Brazil
6    LuísGonçalves        382  2013-08-07 00:00:00         Brazil
7   EduardoMartins         25  2009-04-09 00:00:00         Brazil
8   EduardoMartins        154  2010-11-14 00:00:00         Brazil
9   EduardoMartins        177  2011-02-16 00:00:00         Brazil
10  EduardoMartins        199  2011-05-21 00:00:00         Brazil
11  EduardoMartins        251  2012-01-09 00:00:00         Brazil
12  EduardoMartins        372  2013-07-02 00:00:00         Brazil
13  EduardoMartins        383  2013-08-12 00:00:00         Brazil
14  AlexandreRocha         57  2009-09-06 00:00:00         Brazil
15  AlexandreRocha         68  2009-10-17 00:00:00         Brazil
16  AlexandreRocha        123  2010-06-17 00:00:00         Brazil
17  AlexandreRocha        252  2012-01-22 00:00:00         Brazil
18  AlexandreRocha        275  2012-04-25 00:00:00         Brazil
19  AlexandreRocha        297  2012-07-28 00:00:00         Brazil
20  AlexandreRocha        349  2013-03-18 00:00:00         Brazil
21  RobertoAlmeida         34  2009-05-23 00:00:00         Brazil
22  RobertoAlmeida        155  2010-11-14 00:00:00         Brazil
23  RobertoAlmeida        166  2010-12-25 00:00:00         Brazil
24  RobertoAlmeida        221  2011-08-25 00:00:00         Brazil
25  RobertoAlmeida        350  2013-03-31 00:00:00         Brazil
26  RobertoAlmeida        373  2013-07-03 00:00:00         Brazil
27  RobertoAlmeida        395  2013-10-05 00:00:00         Brazil
28   FernandaRamos         35  2009-06-05 00:00:00         Brazil
29   FernandaRamos         58  2009-09-07 00:00:00         Brazil
30   FernandaRamos         80  2009-12-10 00:00:00         Brazil
31   FernandaRamos        132  2010-07-31 00:00:00         Brazil
32   FernandaRamos        253  2012-01-22 00:00:00         Brazil
33   FernandaRamos        264  2012-03-03 00:00:00         Brazil
34   FernandaRamos        319  2012-11-01 00:00:00         Brazil

In [14]:
query = """
SELECT c.Firstname ||''||c.Lastname as "Fullname", i.invoiceId,i.invoiceDate,i.BillingCountry
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId AND c.Country="Brazil" 
"""

pd.read_sql_query(query,connection)

DatabaseError: Execution failed on sql '
SELECT c.Firstname ||''||c.Lastname as "Fullname", i.invoiceId,i.invoiceDate,i.BillingCountry
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId AND c.Country="Brazil"
': no such column: c.Firstname

### 2.	Facturas de Clientes de Brasil

In [22]:
query = """
SELECT i.*
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country= "Brazil"
"""

pd.read_sql_query(query,connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [30]:
query = """
SELECT i.*, e.FirstName ||""|| e.LastName as "Fullname"
FROM employees e 
JOIN customers c ON e.EmployeeId  = c.SupportRepId
JOIN invoices i ON i.CustomerId = c.CustomerId
"""
pd.read_sql_query(query,connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Fullname
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,JanePeacock
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,JanePeacock
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,JanePeacock
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,JanePeacock
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,JanePeacock
...,...,...,...,...,...,...,...,...,...,...
407,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91,SteveJohnson
408,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98,SteveJohnson
409,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96,SteveJohnson
410,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94,SteveJohnson
411,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99,SteveJohnson

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [47]:
query = """
SELECT e.FirstName||" "||e.LastName as "FullNameEmployee", i.InvoiceId, c.FirstName||" "||c.LastName as "FullNameCustomer", c.Country, i.Total
FROM employees e 
JOIN customers c ON e.EmployeeId  = c.SupportRepId
JOIN invoices i ON i.CustomerId = c.CustomerId


"""

pd.read_sql_query(query,connection)

    FullNameEmployee  InvoiceId FullNameCustomer Country  Total
0       Jane Peacock         98   Luís Gonçalves  Brazil   3.98
1       Jane Peacock        121   Luís Gonçalves  Brazil   3.96
2       Jane Peacock        143   Luís Gonçalves  Brazil   5.94
3       Jane Peacock        195   Luís Gonçalves  Brazil   0.99
4       Jane Peacock        316   Luís Gonçalves  Brazil   1.98
..               ...        ...              ...     ...    ...
407     Jane Peacock         45  Puja Srivastava   India   5.94
408     Jane Peacock         97  Puja Srivastava   India   1.99
409     Jane Peacock        218  Puja Srivastava   India   1.98
410     Jane Peacock        229  Puja Srivastava   India  13.86
411     Jane Peacock        284  Puja Srivastava   India   8.91

[412 rows x 5 columns]

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [45]:
query = """
SELECT i.InvoiceId,t.name 
FROM Invoice_Items i 
JOIN invoices ii ON i.InvoiceId = ii.InvoiceId
JOIN tracks t ON t.TrackId = i.TrackId
"""

pd.read_sql_query(query,connection)

      InvoiceId                           Name
0            98            Experiment In Terra
1            98              Take the Celestra
2           121              Shout It Out Loud
3           121               Calling Dr. Love
4           121                       Strutter
...         ...                            ...
2235        284           Esporrei Na Manivela
2236        284  No Fundo Do Quintal Da Escola
2237        284                 Que Luz É Essa
2238        284          The Power Of Equality
2239        284   Mellowship Slinky In B Major

[2240 rows x 2 columns]

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [13]:
query = """
SELECT t.Name as "Song Name", m.Name as "Format", a.Title as "Album", g.Name as "Genre"
FROM tracks t
JOIN albums a ON a.AlbumId = t.AlbumId
JOIN genres g ON t.GenreId = g.GenreId
JOIN media_types m ON t.MediaTypeId = m.MediaTypeId
"""
pd.read_sql_query(query,connection)

,Song Name,Format,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [20]:
#metodo uno al agrupar por nombre no estas teniendo en cuenta el criterio riguroso de la tabla que es el id si vamos a contar elementos mejor tener en cuenta el id 
query="""
SELECT pl.Name AS "playlist", COUNT(*)
FROM playlists pl
JOIN playlist_track pt ON pl.playlistId=pt.playlistId
GROUP BY pl.Name
"""
pd.read_sql_query(query,connection)

                      playlist  COUNT(*)
0                   90’s Music      1477
1              Brazilian Music        39
2                    Classical        75
3    Classical 101 - Deep Cuts        25
4   Classical 101 - Next Steps        25
5   Classical 101 - The Basics        25
6                       Grunge        15
7          Heavy Metal Classic        26
8                        Music      6580
9                 Music Videos         1
10                 On-The-Go 1         1
11                    TV Shows       426

In [22]:
#metodo 2 salen mas listas
query="""
SELECT pl.Name AS "playlist", COUNT(pl.playlistId)
FROM playlists pl
JOIN playlist_track pt ON pl.playlistId=pt.playlistId
GROUP BY pl.playlistId
"""
pd.read_sql_query(query,connection)

                      playlist  COUNT(pl.playlistId)
0                        Music                  3290
1                     TV Shows                   213
2                   90’s Music                  1477
3                        Music                  3290
4                 Music Videos                     1
5                     TV Shows                   213
6              Brazilian Music                    39
7                    Classical                    75
8    Classical 101 - Deep Cuts                    25
9   Classical 101 - Next Steps                    25
10  Classical 101 - The Basics                    25
11                      Grunge                    15
12         Heavy Metal Classic                    26
13                 On-The-Go 1                     1

### 8.	Muestra cuánto (cantidad) ha vendido cada empleado.

In [26]:
#agrupar mejor por las claves primarias -> en este caso employid
query="""
SELECT e.FirstName ||''|| e.LastName as "employee", SUM(quantity) as "song sold"
FROM employees e
JOIN customers c ON c.SupportRepId=e.EmployeeId
JOIN invoices i ON i.customerId=c.customerId
JOIN invoice_items ii on ii.invoiceId = i.invoiceId
GROUP BY e.employeeId 
"""
pd.read_sql_query(query,connection) #solo hay 3 que venden

       employee  song sold
0   JanePeacock        796
1  MargaretPark        760
2  SteveJohnson        684

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [34]:
#se ordena de mayor a menor con order by desc y el where es que la factura empieze por 2009 
query="""
SELECT e.FirstName ||''|| e.LastName as "employee", SUM (Total) as "sales"
FROM employees e
JOIN customers c ON e.employeeid=c.supportrepid
JOIN invoices i ON c.customerId=i.customerId 
WHERE  i.InvoiceDate LIKE "2009%"
GROUP BY employeeid
ORDER BY  Sales DESC 
LIMIT 1 
""" 
pd.read_sql_query(query,connection)

       employee   sales
0  SteveJohnson  164.34

### 10.	¿Cuáles son los 3 grupos que más han vendido cantidad?

In [50]:
query="""
SELECT t.composer, SUM(quantity) as "sales"
FROM tracks t 
JOIN invoice_items i ON t.trackid = i.trackid
GROUP BY t.composer
ORDER BY sales DESC 
LIMIT 3
"""
pd.read_sql_query(query,connection)

       Composer  sales
0          None    596
1  Steve Harris     58
2            U2     33

### 11. Muestra cuántas canciones de Rock hay en cada playlist

In [62]:
#AGRUPAMIENTO POR CLAVE PRIMARIA NO OLVIDAR
query="""
SELECT p.name as playlist, count(t.name) as "songs"
FROM genres g
JOIN tracks t ON t.genreid = g.genreid
JOIN playlist_track pt ON t.trackid = pt.trackid
JOIN playlists p ON pt.PlaylistId=p.PlaylistId
WHERE g.Name = "Rock"
GROUP BY p.playlistid

"""
pd.read_sql_query(query,connection)

              playlist  songs
0                Music   1297
1           90’s Music    621
2                Music   1297
3               Grunge     14
4  Heavy Metal Classic      9

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

In [70]:
#POR LA COLETILLA DE HAYAN SIDO VENDIDAS ALGUNA VEZ O NO
query="""
SELECT t.name as "song", i.InvoiceId as "factura"
FROM tracks t 
LEFT JOIN invoice_items i ON t.TrackId=i.TrackId
"""
pd.read_sql_query(query,connection)

                                                   song  factura
0               For Those About To Rock (We Salute You)    108.0
1                                     Balls to the Wall      1.0
2                                     Balls to the Wall    214.0
3                                       Fast As a Shark    319.0
4                                     Restless and Wild      1.0
...                                                 ...      ...
3754  String Quartet No. 12 in C Minor, D. 703 "Quar...    108.0
3755  String Quartet No. 12 in C Minor, D. 703 "Quar...    319.0
3756               L'orfeo, Act 3, Sinfonia (Orchestra)      NaN
3757  Quintet for Horn, Violin, 2 Violas, and Cello ...      NaN
3758                                      Koyaanisqatsi      NaN

[3759 rows x 2 columns]

### 13. ¿Cuántos artistas no tienen ningún album?

In [2]:
query = """
SELECT COUNT(*) as "Artists without album"
FROM artists a
LEFT JOIN albums aa ON a.ArtistId = aa.ArtistId
WHERE aa.Title IS NULL
"""
pd.read_sql_query(query,connection)

NameError: name 'pd' is not defined